Tekla.Structures.DirectManipulation.Model.CreationCommands
The Tekla.Structures.DirectManipulation.Model.CreationCommands class is a Tekla.BIM.DirectManipulation.Features.CreationCommandParameter factory for Tekla Structures.

Tekla.Structures.DirectManipulation.Model.CreationCommands.Beam
Gets the creation commands for creating any beam typed object.

Tekla.Structures.DirectManipulation.Model.CreationCommands.ContourPlate
Gets the creation commands for creating a contour plate.

Tekla.Structures.DirectManipulation.Model.CreationCommands.LoftedPlate
Gets the creation command for creating a lofted plate.

Tekla.Structures.DirectManipulation.Model.CreationCommands.Item
Gets the creation commands for creating an item.

Tekla.Structures.DirectManipulation.Model.CreationCommands.PolyBeam
Gets the creation commands for creating any polybeam typed object.

Tekla.Structures.DirectManipulation.Model.CreationCommands.Reinforcement
Gets the creation commands for creating any reinforcement typed object.

Tekla.Structures.DirectManipulation.Model.CreationCommands.BentPlate
Gets the creation command for creating a bent plate object

Tekla.Structures.DirectManipulation.Model.CreationCommands.SpiralBeam
Gets the creation command for creating a spiral beam object

Tekla.Structures.DirectManipulation.Model.CreationCommands.ConstructionObject
Gets the creation command for creating a construction object

Tekla.Structures.DirectManipulation.Model.CreationCommands.Grid
Gets the creation command for creating a grid

Tekla.Structures.DirectManipulation.Model.CreationCommands.View
Gets the creation command for creating a view.

Tekla.Structures.DirectManipulation.Model.CreationCommands.For``1
Gets an instance of Tekla.Structures.DirectManipulation.Model.CreationCommands.InputSpecificProvider for the .
The type of the object.
Returns: An instance of Tekla.Structures.DirectManipulation.Model.CreationCommands.InputSpecificProvider for the .

Tekla.Structures.DirectManipulation.Model.CreationCommands.GetStringRepresentation(System.Type)
Gets the System.String representation of the given System.Type,
as provided by Tekla.Structures.DirectManipulation.Model.ModelObjectTypeStringMap.
type: The System.Type to get the System.String representation of.
Returns: The System.String representation of the given System.Type.